OpenFOAM-v1812/tutorials/compressible/rhoPimpleAdiabaticFoam/rutlandVortex2D/Allrun
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

restore0Dir
runApplication blockMesh
runApplication -s preProcess $(getApplication) -postProcess -dict system/preProcess
runApplication decomposePar
runParallel $(getApplication)

#------------------------------------------------------------------------------
